---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsGenericTransformFailure
source: html/723a9557-36df-f558-fcfe-844c6d7a2dbe.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsGenericTransformFailure Property

Cannot change base elevation of Stairs

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsGenericTransformFailure { get; }
```